Revit 2026 API

# TypeBinding Constructor

---

Constructs an empty type binding.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TypeBinding()
```
```vb
Public Sub New
```
```cpp
public:
TypeBinding()
```
```fsharp
new : unit -> TypeBinding
```

Categories can be set a later time by using the Categories property of this object.

#### Reference

TypeBinding Class

TypeBinding Overload

Autodesk.Revit.DB Namespace